mik4el/cc1352-swim-thermo/software/fulltest_CC1352R1_SWIMTHERMO_tirtos_ccs/CC1352R1_SWIMTHERMO.c
/*
 * Copyright (c) 2017-2018, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ====================== CC1352R1_SWIMTHERMO.c ===================================
 *  This file is responsible for setting up the board specific items for the
 *  CC1352R1_SWIMTHERMO board.
 */

#include <CC1352R1_SWIMTHERMO.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include <ti/devices/cc13x2_cc26x2_v1/driverlib/ioc.h>
#include <ti/devices/cc13x2_cc26x2_v1/driverlib/udma.h>
#include <ti/devices/cc13x2_cc26x2_v1/inc/hw_ints.h>
#include <ti/devices/cc13x2_cc26x2_v1/inc/hw_memmap.h>

#include <ti/drivers/ADCBuf.h>
#include <ti/drivers/adcbuf/ADCBufCC26X2.h>

ADCBufCC26X2_Object adcBufCC26xxObjects[CC1352R1_SWIMTHERMO_ADCBUFCOUNT];

/*
 *  This table converts a virtual adc channel into a dio and internal analogue
 *  input signal. This table is necessary for the functioning of the adcBuf
 *  driver. Comment out unused entries to save flash. Dio and internal signal
 *  pairs are hardwired. Do not remap them in the table. You may reorder entire
 *  entries. The mapping of dio and internal signals is package dependent.
 */
const ADCBufCC26X2_AdcChannelLutEntry ADCBufCC26X2_adcChannelLut[CC1352R1_SWIMTHERMO_ADCBUF0CHANNELCOUNT] = {
    {CC1352R1_SWIMTHERMO_TAO_1, ADC_COMPB_IN_AUXIO7},
    {CC1352R1_SWIMTHERMO_TAO_2, ADC_COMPB_IN_AUXIO6},
    {PIN_UNASSIGNED, ADC_COMPB_IN_VDDS},
    {PIN_UNASSIGNED, ADC_COMPB_IN_DCOUPL},
    {PIN_UNASSIGNED, ADC_COMPB_IN_VSS},
};

const ADCBufCC26X2_HWAttrs adcBufCC26xxHWAttrs[CC1352R1_SWIMTHERMO_ADCBUFCOUNT] = {
    {
        .intPriority       = ~0,
        .swiPriority       = 0,
        .adcChannelLut     = ADCBufCC26X2_adcChannelLut,
        .gpTimerUnit       = CC1352R1_SWIMTHERMO_GPTIMER0A,
    }
};

const ADCBuf_Config ADCBuf_config[CC1352R1_SWIMTHERMO_ADCBUFCOUNT] = {
    {
        &ADCBufCC26X2_fxnTable,
        &adcBufCC26xxObjects[CC1352R1_SWIMTHERMO_ADCBUF0],
        &adcBufCC26xxHWAttrs[CC1352R1_SWIMTHERMO_ADCBUF0]
    },
};

const uint_least8_t ADCBuf_count = CC1352R1_SWIMTHERMO_ADCBUFCOUNT;

/*
 *  =============================== ADC ===============================
 */
#include <ti/drivers/ADC.h>
#include <ti/drivers/adc/ADCCC26XX.h>

ADCCC26XX_Object adcCC26xxObjects[CC1352R1_SWIMTHERMO_ADCCOUNT];

const ADCCC26XX_HWAttrs adcCC26xxHWAttrs[CC1352R1_SWIMTHERMO_ADCCOUNT] = {
    {
        .adcDIO              = CC1352R1_SWIMTHERMO_TAO_1,
        .adcCompBInput       = ADC_COMPB_IN_AUXIO7,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = false
    },
    {
        .adcDIO              = CC1352R1_SWIMTHERMO_TAO_2,
        .adcCompBInput       = ADC_COMPB_IN_AUXIO6,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = false
    },
    {
        .adcDIO              = PIN_UNASSIGNED,
        .adcCompBInput       = ADC_COMPB_IN_DCOUPL,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = false
    },
    {
        .adcDIO              = PIN_UNASSIGNED,
        .adcCompBInput       = ADC_COMPB_IN_VSS,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = false
    },
    {
        .adcDIO              = PIN_UNASSIGNED,
        .adcCompBInput       = ADC_COMPB_IN_VDDS,
        .refSource           = ADCCC26XX_FIXED_REFERENCE,
        .samplingDuration    = ADCCC26XX_SAMPLING_DURATION_2P7_US,
        .inputScalingEnabled = true,
        .triggerSource       = ADCCC26XX_TRIGGER_MANUAL,
        .returnAdjustedVal   = false
    }
};

const ADC_Config ADC_config[CC1352R1_SWIMTHERMO_ADCCOUNT] = {
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[CC1352R1_SWIMTHERMO_ADC0], &adcCC26xxHWAttrs[CC1352R1_SWIMTHERMO_ADC0]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[CC1352R1_SWIMTHERMO_ADC1], &adcCC26xxHWAttrs[CC1352R1_SWIMTHERMO_ADC1]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[CC1352R1_SWIMTHERMO_ADCDCOUPL], &adcCC26xxHWAttrs[CC1352R1_SWIMTHERMO_ADCDCOUPL]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[CC1352R1_SWIMTHERMO_ADCVSS], &adcCC26xxHWAttrs[CC1352R1_SWIMTHERMO_ADCVSS]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[CC1352R1_SWIMTHERMO_ADCVDDS], &adcCC26xxHWAttrs[CC1352R1_SWIMTHERMO_ADCVDDS]},
};

const uint_least8_t ADC_count = CC1352R1_SWIMTHERMO_ADCCOUNT;

/*
 *  =============================== GPTimer ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/timer/GPTimerCC26XX.h>

GPTimerCC26XX_Object gptimerCC26XXObjects[CC1352R1_SWIMTHERMO_GPTIMERCOUNT];

const GPTimerCC26XX_HWAttrs gptimerCC26xxHWAttrs[CC1352R1_SWIMTHERMO_GPTIMERPARTSCOUNT] = {
    { .baseAddr = GPT0_BASE, .intNum = INT_GPT0A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT0, .pinMux = GPT_PIN_0A, },
    { .baseAddr = GPT0_BASE, .intNum = INT_GPT0B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT0, .pinMux = GPT_PIN_0B, },
    { .baseAddr = GPT1_BASE, .intNum = INT_GPT1A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT1, .pinMux = GPT_PIN_1A, },
    { .baseAddr = GPT1_BASE, .intNum = INT_GPT1B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT1, .pinMux = GPT_PIN_1B, },
    { .baseAddr = GPT2_BASE, .intNum = INT_GPT2A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT2, .pinMux = GPT_PIN_2A, },
    { .baseAddr = GPT2_BASE, .intNum = INT_GPT2B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT2, .pinMux = GPT_PIN_2B, },
    { .baseAddr = GPT3_BASE, .intNum = INT_GPT3A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT3, .pinMux = GPT_PIN_3A, },
    { .baseAddr = GPT3_BASE, .intNum = INT_GPT3B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT3, .pinMux = GPT_PIN_3B, },
};

const GPTimerCC26XX_Config GPTimerCC26XX_config[CC1352R1_SWIMTHERMO_GPTIMERPARTSCOUNT] = {
    { &gptimerCC26XXObjects[CC1352R1_SWIMTHERMO_GPTIMER0], &gptimerCC26xxHWAttrs[CC1352R1_SWIMTHERMO_GPTIMER0A], GPT_A },
    { &gptimerCC26XXObjects[CC1352R1_SWIMTHERMO_GPTIMER0], &gptimerCC26xxHWAttrs[CC1352R1_SWIMTHERMO_GPTIMER0B], GPT_B },
    { &gptimerCC26XXObjects[CC1352R1_SWIMTHERMO_GPTIMER1], &gptimerCC26xxHWAttrs[CC1352R1_SWIMTHERMO_GPTIMER1A], GPT_A },
    { &gptimerCC26XXObjects[CC1352R1_SWIMTHERMO_GPTIMER1], &gptimerCC26xxHWAttrs[CC1352R1_SWIMTHERMO_GPTIMER1B], GPT_B },
    { &gptimerCC26XXObjects[CC1352R1_SWIMTHERMO_GPTIMER2], &gptimerCC26xxHWAttrs[CC1352R1_SWIMTHERMO_GPTIMER2A], GPT_A },
    { &gptimerCC26XXObjects[CC1352R1_SWIMTHERMO_GPTIMER2], &gptimerCC26xxHWAttrs[CC1352R1_SWIMTHERMO_GPTIMER2B], GPT_B },
    { &gptimerCC26XXObjects[CC1352R1_SWIMTHERMO_GPTIMER3], &gptimerCC26xxHWAttrs[CC1352R1_SWIMTHERMO_GPTIMER3A], GPT_A },
    { &gptimerCC26XXObjects[CC1352R1_SWIMTHERMO_GPTIMER3], &gptimerCC26xxHWAttrs[CC1352R1_SWIMTHERMO_GPTIMER3B], GPT_B },
};

/*
 *  =============================== PIN ===============================
 */
#include <ti/drivers/PIN.h>
#include <ti/drivers/pin/PINCC26XX.h>

const PIN_Config BoardGpioInitTable[] = {

    CC1352R1_SWIMTHERMO_PSU_ENABLE | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL | PIN_DRVSTR_MAX, /* LED PSU initially off */
    CC1352R1_SWIMTHERMO_T_ON_1 | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL, /* T_ON_1 should be default high */
    CC1352R1_SWIMTHERMO_T_ON_2 | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL, /* T_ON_2 should be default low */
    CC1352R1_SWIMTHERMO_SWITCH | PIN_INPUT_EN | PIN_PULLUP | PIN_IRQ_BOTHEDGES | PIN_HYSTERESIS,             /* Button is active low */
    PIN_TERMINATE
};

const PINCC26XX_HWAttrs PINCC26XX_hwAttrs = {
    .intPriority = ~0,
    .swiPriority = 0
};

/*
 *  =============================== Power ===============================
 */
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26X2.h>

const PowerCC26X2_Config PowerCC26X2_config = {
    .policyInitFxn      = NULL,
    .policyFxn          = &PowerCC26XX_standbyPolicy,
    .calibrateFxn       = &PowerCC26XX_calibrate,
    .enablePolicy       = true,
    .calibrateRCOSC_LF  = true,
    .calibrateRCOSC_HF  = true,
};

/*
 *  =============================== RF Driver ===============================
 */
#include <ti/drivers/rf/RF.h>

const RFCC26XX_HWAttrsV2 RFCC26XX_hwAttrs = {
    .hwiPriority        = ~0,     /* Lowest HWI priority */
    .swiPriority        = 0,      /* Lowest SWI priority */
    .xoscHfAlwaysNeeded = true,   /* Keep XOSC dependency while in stanby */
};

/*
 *  =============================== SPI DMA ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPICC26XXDMA.h>

SPICC26XXDMA_Object spiCC26XXDMAObjects[CC1352R1_SWIMTHERMO_SPICOUNT];

/*
 * NOTE: The SPI instances below can be used by the SD driver to communicate
 * with a SD card via SPI.  The 'defaultTxBufValue' fields below are set to 0xFF
 * to satisfy the SDSPI driver requirement.
 */
const SPICC26XXDMA_HWAttrsV1 spiCC26XXDMAHWAttrs[CC1352R1_SWIMTHERMO_SPICOUNT] = {
    {
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = CC1352R1_SWIMTHERMO_SPI0_MOSI,
        .misoPin            = CC1352R1_SWIMTHERMO_SPI0_MISO,
        .clkPin             = CC1352R1_SWIMTHERMO_SPI0_CLK,
        .csnPin             = CC1352R1_SWIMTHERMO_SPI0_CSN,
        .minDmaTransferSize = 10
    },
    {
        .baseAddr           = SSI1_BASE,
        .intNum             = INT_SSI1_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI1,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI1_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI1_TX,
        .mosiPin            = CC1352R1_SWIMTHERMO_SPI1_MOSI,
        .misoPin            = CC1352R1_SWIMTHERMO_SPI1_MISO,
        .clkPin             = CC1352R1_SWIMTHERMO_SPI1_CLK,
        .csnPin             = CC1352R1_SWIMTHERMO_SPI1_CSN,
        .minDmaTransferSize = 10
    }
};

const SPI_Config SPI_config[CC1352R1_SWIMTHERMO_SPICOUNT] = {
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC1352R1_SWIMTHERMO_SPI0],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC1352R1_SWIMTHERMO_SPI0]
    },
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC1352R1_SWIMTHERMO_SPI1],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC1352R1_SWIMTHERMO_SPI1]
    },
};

const uint_least8_t SPI_count = CC1352R1_SWIMTHERMO_SPICOUNT;

/*
 *  =============================== UDMA ===============================
 */
#include <ti/drivers/dma/UDMACC26XX.h>

UDMACC26XX_Object udmaObjects[CC1352R1_SWIMTHERMO_UDMACOUNT];

const UDMACC26XX_HWAttrs udmaHWAttrs[CC1352R1_SWIMTHERMO_UDMACOUNT] = {
    {
        .baseAddr    = UDMA0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_UDMA,
        .intNum      = INT_DMA_ERR,
        .intPriority = ~0
    }
};

const UDMACC26XX_Config UDMACC26XX_config[CC1352R1_SWIMTHERMO_UDMACOUNT] = {
    {
         .object  = &udmaObjects[CC1352R1_SWIMTHERMO_UDMA0],
         .hwAttrs = &udmaHWAttrs[CC1352R1_SWIMTHERMO_UDMA0]
    },
};

/*
 *  Board-specific initialization function to disable external flash.
 *  This function is defined in the file CC1352R1_SWIMTHERMO_fxns.c
 */
extern void Board_initHook(void);

/*
 *  ======== CC1352R1_SWIMTHERMO_initGeneral ========
 */
void CC1352R1_SWIMTHERMO_initGeneral(void)
{
    Power_init();

    if (PIN_init(BoardGpioInitTable) != PIN_SUCCESS) {
        /* Error with PIN_init */
        while (1);
    }

    /* Perform board-specific initialization */
    Board_initHook();
}
